#这是一个针对于Arduino上软硬串口1到软硬串口2的整数指令转发成十六进制指令程序

#如有不足，还望之处🙏

#新手在此敬礼感谢🙏

-------------------------------

#include <SoftwareSerial.h>

SoftwareSerial mySerial(13,12);                 //定义软串口tx,rx

int var;                                        //定义接受数据类型为int

void setup() {
  Serial.begin(9600);                           //定义硬串口波特率为9600 8 N 1
  mySerial.begin(9600);                         //定义软串口波特率为9600 8 N 1
}

void loop() {

  if(Serial.available() > 0){                   //判断硬串口是否收到数据
    delay(100);
    var = Serial.parseInt();                    //收到数据赋值给var
  }
  switch(var){                                  //根据var的值进行相应指令条件发送
    case 1:
      unsigned char a[90]={
          0XFD,0XFD,0X30,0X03,0X79,0XE3,0X00,0X34,0X64,0X00,
          0XC0,0X00,0X43,0X00,0X1B,0X00,0X15,0X00,0X1B,0X00,
          0X00,0X00,0X15,0X00,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,
          0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,0XFF,
          0X01,0X12,0X22,0X12,0X21,0X12,0X12,0X21,0X12,0X11,
          0X22,0X12,0X21,0X22,0X22,0X22,0X22,0X22,0X22,0X22,
          0X22,0X21,0X22,0X12,0X21,0X11,0X22,0X22,0X21,0X11,
          0X12,0X22,0X22,0X22,0X22,0X21,0X22,0X22,0X22,0X22,
          0X22,0X22,0X22,0X22,0X22,0X22,0X22,0X22,0X22,0X22
      };
      Serial.write(a,90);
    break;
    case 2:
      unsigned char b[60]={
          0X22,0X22,0X21,0X11,0X12,0X22,0X13,0XF0,0X00,0X00,
          0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
          0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
          0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
          0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
          0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00
      };
      Serial.write(b,60);
    break;
    case 3:
      unsigned char c[40]={
          0X00,0X00,0X20,0X00,0X01,0X00,0X00,0X00,0X00,0X00,
          0X00,0X30,0X00,0X00,0X10,0X00,0X00,0X00,0X00,0X00,
          0X00,0X00,0X20,0X00,0X01,0X00,0X00,0X00,0X00,0X00,
          0X00,0X30,0X00,0X00,0X10,0X00,0X00,0X00,0X00,0X00
      };
      Serial.write(c,40);
    break;
    default:
      Serial.println("ABC");
    break;
  }
}
